app/views/guardians/index.html.erb

SELECT "students".* FROM "students" INNER JOIN "student_guardians" ON "students"."id" = "student_guardians"."student_id" WHERE "student_guardians"."guardian_id" = 1
SELECT 1 AS one FROM "students" INNER JOIN "student_guardians" ON "students"."id" = "student_guardians"."student_id" WHERE "student_guardians"."guardian_id" = 1 LIMIT 1
---
        <td><%= guardian.contact_number %></td>
          <% if guardian.students.any? %>
            <%= guardian.students.map(&:name).join(", ") %>