app/views/guardians/show.html.erb

  <tbody>
    <% @guardian.student_guardians.each do |sg| %>
---
SELECT "student_guardians".* FROM "student_guardians" WHERE "student_guardians"."guardian_id" = 1