app/views/students/_form.html.erb

SELECT "departments".* FROM "departments"
---
        <%= f.label :department_id, "Department", class: "form-label fw-bold" %>
        <%= f.collection_select :department_id, Department.all, :id, :name,
            { prompt: "Select a department" },
            { class: "form-select" } %>