app/views/students/show.html.erb

  <tbody>
    <% @student.classlists.each do |classlist| %>
---
SELECT "classlists".* FROM "classlists" WHERE "classlists"."student_id" = 1