app/views/departments/show.html.erb

SELECT "students".* FROM "students" WHERE "students"."department_id" = 1
---
      <tbody>
        <% @department.students.each do |student| %>