app/views/sections/_form.html.erb

SELECT "subjects".* FROM "subjects"
---
    <%= form.label :subject_id, style: "display: block" %>
    <%= form.collection_select :subject_id, Subject.all, :id, :name, prompt: "Select a subject" %>