app/views/sections/_form.html.erb

        <%= form.label :subject_id, "Subject", class: "form-label fw-bold", style: "color: #ffce1b;" %>
        <%= form.collection_select :subject_id, Subject.all, :id, :name,
              { prompt: "Select a subject" },
              { class: "form-select", style: "background-color: black; color: #ffce1b; border-color: #ffce1b;" } %>
---
SELECT "subjects".* FROM "subjects"