app/views/student_guardians/_form.html.erb

        <%= f.label :student_id, "Student", class: "form-label fw-bold" %>
        <%= f.collection_select :student_id, Student.all, :id, :name, { prompt: "Select a student" }, { class: "form-select" } %>
---
SELECT "students".* FROM "students"

        <%= f.label :guardian_id, "Guardian", class: "form-label fw-bold" %>
        <%= f.collection_select :guardian_id, Guardian.all, :id, :name, { prompt: "Select a guardian" }, { class: "form-select" } %>
---
SELECT "guardians".* FROM "guardians"