app/views/subjects/_form.html.erb

SELECT "teachers".* FROM "teachers"
---
    <%= form.label :teacher_id, style: "display: block" %>
    <%= form.collection_select :teacher_id, Teacher.all, :id, :name, prompt: "Select a teacher" %>