app/views/subjects/_form.html.erb

SELECT "teachers".* FROM "teachers"
---
        <%= form.label :teacher_id, "Teacher", class: "form-label fw-bold", style: "color: #ffce1b;" %>
        <%= form.collection_select :teacher_id, Teacher.all, :id, :name,
              { prompt: "Select a teacher" },
              { class: "form-select", style: "background-color: black; color: #ffce1b; border-color: #ffce1b;" } %>