app/views/subjects/show.html.erb

      <tbody>
        <% @subject.sections.each do |section| %>
---
SELECT "sections".* FROM "sections" WHERE "sections"."subject_id" = 1