app/views/subjects/show.html.erb

SELECT "sections".* FROM "sections" WHERE "sections"."subject_id" = 1
---

<% @subject.sections.each do |section| %>