app/views/teachers/show.html.erb

SELECT "subjects".* FROM "subjects" WHERE "subjects"."teacher_id" = 1
---
      <tbody>
        <% @teacher.subjects.each do |subject| %>