app/views/classlists/_form.html.erb

SELECT "students".* FROM "students"
---
    <%= form.label :student_id, style: "display: block" %>
    <%= form.collection_select :student_id, Student.all, :id, :name, prompt: "Select a student" %>

SELECT "sections".* FROM "sections"
---
    <%= form.label :section_id, style: "display: block" %>
    <%= form.collection_select :section_id, Section.all, :id, :name, prompt: "Select a section" %>