app/controllers/classlists_controller.rb

SELECT "classlists".* FROM "classlists"
---
  def index
    @classlists = Classlist.all

INSERT INTO "classlists" ("student_id", "section_id", "created_at", "updated_at") VALUES (1, 2, '2025-11-19 10:24:18.250160', '2025-11-19 10:24:18.250160') RETURNING "id"
---
  def create
    @classlist = Classlist.new(classlist_params)
    @classlist.section.increment!(:number_of_students)
    @classlist.section.increment!(:number_of_students, @classlist.section.subject.number_of_units)

    respond_to do |format|
      if @classlist.save

SELECT "classlists".* FROM "classlists" WHERE "classlists"."id" = 1 LIMIT 1
---
    def set_classlist
      @classlist = Classlist.find(params.expect(:id))