app/controllers/guardians_controller.rb

SELECT "guardians".* FROM "guardians"
---
  def index
    @guardians = Guardian.all

INSERT INTO "guardians" ("name", "email_address", "contact_number", "number_of_students", "created_at", "updated_at") VALUES ('Seungcheol Choi', 'scoups@gmail.com', '09171717171', NULL, '2025-11-19 10:25:41.559242', '2025-11-19 10:25:41.559242') RETURNING "id"
---
  def create
    @guardian = Guardian.new(guardian_params)

    respond_to do |format|
      if @guardian.save

SELECT "guardians".* FROM "guardians" WHERE "guardians"."id" = 1 LIMIT 1
---
  def set_guardian
    @guardian = Guardian.find(params[:id])