app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections"
---
  def index
    @sections = Section.all

INSERT INTO "sections" ("name", "room", "time_slot", "subject_id", "created_at", "updated_at", "number_of_students") VALUES ('GO21-Calculus II', 'D414', 'MW 9:00-10:30', 2, '2025-11-19 10:23:28.529037', '2025-11-19 10:23:28.529037', 0) RETURNING "id"
---
  def create
    @section = Section.new(section_params)

    respond_to do |format|
      if @section.save

UPDATE "sections" SET "subject_id" = 1, "updated_at" = '2025-11-19 11:51:33.087963' WHERE "sections"."id" = 1
---
  def update
    respond_to do |format|
      if @section.update(section_params)

SELECT "sections".* FROM "sections" WHERE "sections"."id" = 1 LIMIT 1
---
    def set_section
      @section = Section.find(params.expect(:id))