app/controllers/students_controller.rb

SELECT "departments".* FROM "departments" WHERE "departments"."id" = 1 LIMIT 1
UPDATE "departments" SET "student_count" = COALESCE("student_count", 0) + 1 WHERE "departments"."id" = 1
INSERT INTO "students" ("name", "year_level", "program", "department_id", "created_at", "updated_at", "number_of_units", "total_assessment") VALUES ('Wonwoo Jeon', 3, 'Computer Engineering', 1, '2025-11-19 10:21:46.236018', '2025-11-19 10:21:46.236018', 0, 0) RETURNING "id"
---
  def create
    @student = Student.new(student_params)
    @department = Department.find(@student.department_id)

    respond_to do |format|
      if @student.save
        @department.increment!(:student_count)

SELECT "students".* FROM "students" WHERE "students"."id" = 1 LIMIT 1
---
    def set_student
      @student = Student.find(params.expect(:id))