app/controllers/student_guardians_controller.rb

SELECT "student_guardians".* FROM "student_guardians"
---
  def index
    @student_guardians = StudentGuardian.all

INSERT INTO "student_guardians" ("student_id", "guardian_id", "relationship", "created_at", "updated_at") VALUES (1, 2, 'Father', '2025-11-19 10:26:45.635453', '2025-11-19 10:26:45.635453') RETURNING "id"
---
  def create
    @student_guardian = StudentGuardian.new(student_guardian_params)

    respond_to do |format|
      if @student_guardian.save

SELECT "guardians".* FROM "guardians" WHERE "guardians"."id" = 2 LIMIT 1
SELECT "student_guardians".* FROM "student_guardians" WHERE "student_guardians"."id" = 1 LIMIT 1
---
    def set_student_guardian
      @student_guardian = StudentGuardian.find(params.expect(:id))