app/controllers/subjects_controller.rb

  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("name", "teacher_id", "created_at", "updated_at", "number_of_units") VALUES ('Integral Calculus', 1, '2025-11-19 10:22:53.684128', '2025-11-19 10:22:53.684128', 3) RETURNING "id"

    def set_subject
      @subject = Subject.find(params.expect(:id))
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = 1 LIMIT 1