app/controllers/teachers_controller.rb

SELECT "departments".* FROM "departments" WHERE "departments"."id" = 1 LIMIT 1
UPDATE "departments" SET "employee_count" = COALESCE("employee_count", 0) + 1 WHERE "departments"."id" = 1
INSERT INTO "teachers" ("name", "email", "specialization", "status", "department_id", "created_at", "updated_at", "number_of_units", "monthly_salary") VALUES ('Jean Paul Paje', 'jpaje@gbox.adnu.edu.ph', 'Physics', 'Full-Time', 1, '2025-11-19 10:22:12.310905', '2025-11-19 10:22:12.310905', 0, 0) RETURNING "id"
---
  def create
    @teacher = Teacher.new(teacher_params)
    @department = Department.find(@teacher.department_id)

    respond_to do |format|
      if @teacher.save
        @department.increment!(:employee_count)

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = 1 LIMIT 1
---
    def set_teacher
      @teacher = Teacher.find(params.expect(:id))